# IsSameNode Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
MEPAnalyticalNode..::..IsSameNode Method
MEPAnalyticalNode Class See Also
---
Verify if this node is connected to the other node and thus represents the same analytical node in the network.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public bool IsSameNode(
	MEPAnalyticalNode other
)
```

Visual Basic
---
```text
Public Function IsSameNode ( _
	other As MEPAnalyticalNode _
) As Boolean
```

Visual C++
---
```text
public:
bool IsSameNode(
	MEPAnalyticalNode^ other
)
```

# ### Parameters
other
    Type: Autodesk.Revit.DB.Analysis..::..MEPAnalyticalNode The other node to be compared.
# ### Return Value
True if two nodes represent the same node of the network. Otherwise false.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
MEPAnalyticalNode Class
Autodesk.Revit.DB.Analysis Namespace